import React, {Component} from 'react';
import {
    Dimensions,
    Image,
    KeyboardAvoidingView,
    Text,
    TextInput,
    TouchableHighlight,
    View,
    ScrollView,
    StyleSheet
} from 'react-native';
import authStyles, {height, width} from './AuthStyles';

export default class ContractPage extends Component {

    render() {
        let dontShowBtn = this.props.navigation.getParam('dontShowConfirmBtn');
        return (
            <View style={{alignItems: 'center', justifyContent: 'center', alignContent: 'center'}}>
                <Text style={[styles.titleText, {marginTop: 15}]}>متن قرار داد بین کایزن و ماهرخ</Text>
                <View style={{
                    height: height / 1.5,
                    width: width / 1.05,
                    alignItems: 'center',
                    marginTop: 20,
                    padding: 10,
                    borderWidth: 1,
                    borderColor: '#B08C3E',
                    borderRadius: 5
                }}>
                    <ScrollView>

                        {contract.map((item, index) => {
                            return (
                                <View key={index}>
                                    <Text style={styles.titleText}>{item.title}</Text>
                                    <Text style={{fontFamily: 'IRANSansWebLight', fontSize: 13}}>{item.text} </Text>
                                </View>
                            )
                        })}
                    </ScrollView>
                </View>
                {
                    dontShowBtn !== 'yes' ?
                        <TouchableHighlight style={authStyles.btn_register} onPress={this._onRegisterPressButton}>
                            <Text style={authStyles.btn_register_txt}>موارد فوق را قبول دارم</Text>
                        </TouchableHighlight> : null
                }
            </View>
        )
    }
}

const styles = StyleSheet.create({
    titleText: {
        fontFamily: 'IRANSansWebMedium',
        fontSize: 16,
        margin: 5
    }
})

const contract = [
    {
        title: 'متن قرارداد شرکت آسان رخ گستر گیتی (ماهرخ)',
        text: 'لطفا قبل از استفاده از خدمات قابل ارایه ماهرخ شرایط و قوانین زیر را بدقت مطالعه کنید .\n' +
            'این شرایط و قوانین به عنوان یک قرارداد لازم الاجرا بر روابط طرفین ، صاحبان کسب و کار ، کاربران ، اشخاص حقیقی و حقوقی و شرکت می باشد. استفاده از ماهرخ مبنی بر قبول کلیه شرایط زیر می باشد و هر گونه ادعا و یا اعتراض در این رابطه را بی اعتبار می نماید و پذیرفته نمی شود.\n' +
            'شرایط وقوانین استفاده از ماهرخ ممکن است در طول زمان از سوی شرکت تغییر یابد ، که در این صورت تغیرات از طریق نرم     افزارهای ماهرخ و یا در قالب پیامک و یا ایمیل و یا دیگر ابزارهای اطلاع رسانی به تمامی کاربران اطلاع داده خواهد شد و ادامه استفاده کاربر از خدمات ماهرخ مبنی بر قبول کلیه شروط جدید می باشد .\n' +
            'ماهرخ یک نرم افزار رزرو خدمات زیبایی آرایشی است که جهت تسهیل در رزرو سالنهای زیبایی و مراکز اسپا و کسب وکارهای مشابه می باشد که توسط شرکت (آسان رخ گستر گیتی) به شماره ثبت 558 طراحی شده است. همچنین پنل مدیریتی ماهرخ نیز خدمات نرم افزاری است که به منظور مدیریت مشاغل مذبور به صاحبان کار ارایه می شود. لازم به ذکر است که خدمات ارائه شده در این نرم افزار از طریق شرکت (آسان رخ گستر گیتی) نبوده و صاحبان کسب و کاری که خدمات خود را با این شرکت شروع کرده اند، مشغول به ارائه خدمات خود می باشند. در این راستا نرم افزار ماهرخ تنها نقش یک واسطه میان مشتری و صاحب کسب و کار را داشته و بر اساس قرارداد میان مشتری و سالن های زیبایی که از ثبت رزرو تا نهایی کردن رزرو کاربران را شامل می شود، مسئول برای تنظیم و نهایی کردن کلیه رزروهای کاربران خواهد بود. در واقع چیزی که در ماهرخ به وقوع می پیوندد انعقاد قراردادی مستقل میان مشتری و صاحب کسب و کار می باشد و هیچ گونه مسئولیتی در قبال اتفاقات افتاده شده چه در مورد مشتریان و چه در مورد صاحبان کسب و کار نخواهد داشت. تمامی کاربرانی که به رزرو نوبت از طریق نرم افزار ماهرخ می پردازند لازم است بدانند که ماهرخ مسئولیتی در برابر خدمات ارائه شده توسط سالن های زیبایی نداشته است.\n'
    }, {
        title: 'شرایط و قوانین مربوط به صاحبان کسب و کار در قبال ماهرخ',
        text: '1.صاحب کسب و کار با توجه به قبول شرایط و قوانین این سند ، موافقت خود را جهت پرداخت کلیه هزینه های بند 2 و 7 سیاستهای قیمت گذاری و نحوه پرداخت همین قرارداد اعلام می دارد.\n' +
            '2.صاحب کسب و کار متعهد است تمامی درخواست های رزرو را بپذیرد و مکلف می شود خدمات خود را در بالاترین حد کیفیت و استاندارد به کاربران ماهرخ ارایه دهد و لازم به ذکر است که نپذیرفتن درخواست کاربر تنها در موارد خاص با صلاحدید شرکت امکانپذیر می باشد.\n' +
            '3.صاحب کسب و کار مکلف است کلیه مجوزها و مدارک لازم را برای استفاده از ماهرخ دارا باشد و مکلف است ظرف 10 روز کاری از تاریخ امضای قرارداد ، مدارک و مجوزهای لازم را به همراه کارت ملی خود به شرکت ارایه نماید. همچنین مسئولیت اصالت و صحت اطلاعات مدارک و مجوزهای ارائه شده بر عهده صاحب کسب و کار می باشد و در صورت ارائه ندادن مدارک و مجوزها تا تاریخ مذکور از طرف صاحب کسب و کار ، شرکت حساب کاربر را مسدود می نماید.\n' +
            '4.صاحب کسب و کار مکلف است که زمان و تاریخ در دسترس بودن سفارش گذاری و رزرو را بطور مداوم بروزرسانی و در اختیار مشتری قرار دهد.\n' +
            '5.صاحب کسب و کار مکلف است که قیمت درج شده در سامانه ماهرخ را دقیقا برابر با قیمت خدمات در محل کسب و کار قرار دهد\n' +
            'در غیر این صورت و در صورت ثابت شدن آن توسط مشتری ، صاحب کسب وکار موظف به عودت مابه التفاوت به مشتری می باشد . مگر اینکه خدمات در قالب طرح های رفاهی و ویژه ارزان تر از قیمت درج شده در سامانه ماهرخ باشد.\n' +
            '6.صاحب کسب و کار مکلف است از قوانین مربوط به کسب و کار خود از جمله قوانین مالیاتی (مالیات بر درآمد و...،صنفی و...)آگاه بوده و موظف به رعایت آن می باشد.\n' +
            '7.لازم به ذکر است که مسئولیت از دست رفتن درآمد، داده ها، قرارهای ملاقات و زیان های نامشهود یا غیر مستقیم دیگر ناشی از کوتاهی،قصور، عدم مهارت و... بر عهده صاحب کسب و کار می باشد و شرکت هیچ مسئولیتی در این زمینه ندارد.\n' +
            '8.صاحب کسب وکار مکلف است در نشر محتوا (تصاویر، فیلم ها، متن و...) در نمایه کسب و کار کاملا دقیق و صحیح مطابق با قوانین و مقررات جمهوری اسلامی ایران و شرع و عرف جامعه باشد واز انتشار تصاویر یا فیلم های مبهم ، دروغین و گمراه کننده\n' +
            'و متعلق به کسب و کارهای دیگری پرهیز نماید، در غیر این صورت شرکت این اختیار را دارد تا در هر زمانی محتوای مذبور را ویرایش ، اصلاح و حذف نماید ودر صورت تکرار مجدد شرکت این اختیار را دارد که حساب کاربری صاحب کسب و کار را مسدود نماید .\n' +
            '9.صاحب کسب و کار مکلف است در مدت اعتبار این قرارداد از همکاری و انعقاد قرارداد با نرم افزارهای مشابه و ایجاد حساب کاربری در آنها اجتناب کند، در غیر این صورت مشمول خسارت خواهد شد و در صورتی که شرکت مشمول خسارت گردد،این خسارت از طریق قانونی وصول خواهد شد.\n' +
            '10.صاحب کسب و کار به هیچ وجه نمی تواند مشتری را تشویق و یا ترغیب به لغو سفارش در ماهرخ و رزرو مستقیم بنماید و همچنین خلاف مقررات است که با گرفتن اطلاعات شخصی و شماره تماس مشتری وی را ترغیب به مراجعه مستقیم و رزرو خدمات خارج از محدوده ماهرخ نماید.\n' +
            '11.صاحب کسب و کار مکلف است در صورت تمایل به قطع همکاری با شرکت، مراتب را یک ماه قبل به صورت کتبی به شرکت اعلام دارد. بدیهی است خاتمه قرارداد تنها منوط به تنظیم صورت جلسه با شرکت و تسویه حساب کامل با شرکت است. در غیر این صورت قرارداد به قوت خود باقی است.\n'
    }, {
        title: 'تعهدات کلیه کاربران اعم از (صاحب کسب و کار و مشتری) در قبال ماهرخ',
        text: '1.همه کاربران (صاحب کسب و کار و مشتری) فقط حق استفاده محدود از پنل کاربری خود را دارند و تحت هیچ شرایطی نمی توانند مالکیت پنل کاربری ماهرخ را داشته باشند، همچنین استفاده از پنل کاربری می بایست حتما تحت شرایط قرارداد عقد شده باشد.\n' +
            '2.هر یک از کاربران که از خدمات ماهرخ استفاده می کنند، مکلفند مسائل و اطلاعات پزشکی خود را قبل از شروع به کار صاحب کسب و کار تحویل و توضیح دهند، در غیر این صورت هنگام بروز مشکل یا حساسیت به هر گونه مواد مصرفی، ماهرخ و صاحب کسب و کار هیچ مسئولیتی را قبول نخواهد کرد.\n' +
            '3.کلیه کاربران (صاحب کسب و کار و مشتری) مکلف به استفاده از حساب کاربری خود می باشد و در صورت قراردادن حساب کاربری در اختیار دیگران و انجام تخلف ،مسئولیت آن بر عهده صاحب کاربری می باشد و چنانچه اطلاعات حساب کاربری مفقود یا به سرقت رود یا ظن دسترسی ثالث به آنها باشد، کاربر موظف است ظرف 48 ساعت موضوع را به شرکت اطلاع دهد.\n' +
            '4.هیچ یک از کاربران(صاحبان کسب و کار و مشتری) ثبت شده در پنل کاربری حق فروش، نمایش عمومی و اجاره پنل خود را به دیگری نخواهد داشت و امکان تغییر پنل کاربری و یا استفاده از آن برای ایجاد برنامه ای مشابه، برای هیچ یک از کاربران امکان پذیر نخواهد بود و کاربران برای استفاده از خدمات ماهرخ تنها در دایره شرایط و قوانین این نرم افزار مجاز به کار خواهند بود.\n' +
            '5.هزینه های جاری مثل کارمزد انتقال وجه و... به عهده کاربران (صاحبان کسب و کار و مشتری) می باشد.\n'
    }, {
        title: 'تعهدات و اختیارات شرکت در قبال کاربران ( صاحب کسب وکار و مشتری )',
        text: '1.شرکت مکلف است اطلاعاتی که از کاربر به صورت مستقیم در هنگام ثبت نام و ساخت حساب کاربری نظیر( نام، نام خانوادگی، شماره تلفن) یا بصورت غیرمستقیم در نتیجه استفاده از خدمات ماهرخ مانند (اطلاعات مشتریان، پرسنل، تعداد مراجعات و تراکنش های مالی) که در نرم افزار ذخیره می شود، حفاظت کند و تنها در جهت بهبود کیفیت خدمات از آنها استفاده نماید.\n' +
            '2.شرکت مکلف است کلیه آموزش های لازم جهت استفاده از نرم افزارهای ماهرخ را بصورت رایگان به صاحب کسب و کار ارائه دهد و با اطلاع از بروز نقص در نرم افزار نسبت به رفع آن اقدام نماید و در تمام طول مدت قرارداد موظف به پشتیبانی فنی از نرم افزار می باشد.\n' +
            '3.شرکت مکلف است کلیه تغییرات، اصلاحات و الحاقات قرارداد حاضر را از طریق نرم افزارهای ماهرخ و یا ایمیل و یا پیامک و یا دیگر ابزارهای اطلاع رسانی به اطلاع کاربران برساند.\n'
    }, {
        title: 'سیاستهای قیمت گذاری و نحوه پرداخت',
        text: '1.صاحب کسب وکار باید یک شماره حساب در نرم افزار ماهرخ وارد نماید تا هنگامی که هزینه خدمات بصورت آنلاین از سوی کاربر پرداخت می شود شرکت این مبالغ را پس از کسر سهم خود در بند 2 سیاستهای قیمت گذاری و نحوه پرداخت به این حساب واریز کند.\n' +
            '2.با توجه به اینکه کاربران از طریق نرم افزار ماهرخ به صاحبان کسب و کار معرفی می گردند، صاحب کسب و کار مکلف است از هر دریافتی خود از کاربر...  درصد آن را تا سقف ... تومان به عنوان حق استفاده از نرم افزار ماهرخ به شرکت بپردازد، در غیر اینصورت شرکت قرارداد را فسخ می نماید و هیچ مسئولیتی در قبال هزینه های پرداختی ندارد و صاحب کسب و کار ملزم است در صورت خسارت، خسارت را پرداخت نماید.\n' +
            '3.تمامی هزینه های خدمات در پنل کاربری صاحبان کسب و کار موجود است و توسط آنها تعیین خواهد شد و کاربران به سادگی می توانند خدمات قابل ارائه با قیمت های تعیین شده مشاهده کنند. بنابراین در صورت انجام رزرو دیگر هیچ کاربری مجاز به اعتراض در مورد هزینه خدمات نخواهد بود.\n' +
            '4.تمامی سفارشاتی که از قبل ثبت شده اند مشمول افزایش و کاهش قیمت ها نخواهند بود. در این صورت در شرایطی که صاحب کسب اقدام به تغییر در هزینه ها کند، این افزایش یا کاهش قیمت تنها شامل رزروهای جدید خواهد شد.\n' +
            '5.صورت حساب یا گزارش حساب یا هر نوع سند به عنوان صورت حساب شامل سفارش های انجام شده ای است که در آن مشتری کل مبلغ و یا درصدی از کل مبلغ را از طریق ماهرخ پرداخته و یا از گزینه پرداخت در محل استفاده کرده و یا سفارش های لغو می باشد که ماهرخ یکبار در ماه آن را به صاحب کسب و کار ارسال می کند، که در صورتی که مجموع صورت حساب عددی منفی باشد به منزله بدهکار بودن ماهرخ به صاحب کسب و کار است که ظرف 3 روز کاری از تاریخ صدور صورت حساب به حساب صاحب کسب و کار واریز خواهد شد و هیچ اقدام دیگری توسط صاحب کسب و کار لازم نیست و اگر مجموع صورت حساب صفر باشد به منزله تسویه حساب کامل است.\n' +
            '6.تمامی هزینه ها توسط درگاه اینترنتی موجود در نرم افزار ماهرخ پرداخت خواهد شد و کلیه تخفیفات اعمال شده در حساب کاربری افراد غیر قابل تبدیل به وجه نقد می باشد.\n' +
            '7.هرگونه خدمات که جزء خدمات رایگان ماهرخ نمی باشد، شامل پرداخت هزینه از طرف مشتری و یا صاحب کسب و کار می شود. مانند (عکاسی، فیلم برداری، تیزر تبلیغاتی و...) که در صورت پرداخت هزینه ها توسط متقاضی قابل ارائه می باشد\n'
    }, {
        title: 'قوانین لغو رزرو',
        text: '1.لغو رزروها حداکثر 24 ساعت قبل از شروع انجام بگیرد و به اطلاع صاحب کسب و کار برسد.\n' +
            '2.در صورت لغو رزرو از طرف کاربران ( صاحب کسب و کار و مشتری) مبلغ واریزی به کیف پول کاربر انتقال داده خواهد شد\n' +
            '3.کاربرانی که مدام در حال ثبت و لغو وقت خود هستند در صورتی که لغو رزرو آنها چند نوبت پشت هم انجام گردد و  به ضرر شرکت و مراکز زیبایی باشد، حساب کاربری آنها مسدود خواهد شد و کلیه هزینه های جاری و انتقال وجه به عهده خود کاربر\n' +
            'می باشد.\n'
    }, {
        title: 'طرح های تشویقی',
        text: 'گاها برای همه یا برخی از کاربران بسته های تشویقی در نظر گرفته خواهد شد که در حساب کاربری آنها اعمال می گردد. این بسته ها دارای مدت زمان استفاده بوده و پس از آن فاقد اعتبار خواهد بود لذا نیاز است تا کاربران برای مشاهده تخفیفات  و طرح های تشویقی خاص به حساب کاربری خود مراجعه کنند.طرح تشویقی به منظور ایجاد تجربه یک روز خوب برای کاربران در نظر گرفته خواهد شد که دارای مدت اعتبار بوده و برای تمامی کاربران قابل استفاده خواهد بود.'
    }, {
        title: 'سایر شرایط',
        text: '1.این قرارداد بین طرفین لازم الاجراست و قبول قرارداد و دریافت کد رهگیری و امکان چاپ قرارداد و یا واریز وجه، مبنی بر قبول قرارداد می باشد و نشان لازم الاجرا بودن قرارداد می باشد وفسخ یک طرفه آن جایز نیست.\n' +
            '2.قرارداد حاضر از تاریخ ورود به نرم افزار به مدت 12 ماه معتبر و لازم الاجراست و پس از انقضای این مدت ، قرارداد منقضی است مگر در صورت اعلام کتبی صاحب کسب و کار مبنی بر تمدید آن قرارداد برای همان مدت قرارداد منقضی شده.\n' +
            '3.در صورت عیب و ایراد شبکه خارج از اراده شرکت، شرکت هیچ مسئولیتی در قبال ارائه خدمات ندارد.\n'
    }, {
        title: 'داوری',
        text: '1.در صورت اختلاف در مفاد قرارداد و یا هر گونه ادعای دیگر خارج از قرارداد، داور مرجع طرفین ،حاکم خواهد بود، اگر نتوانست به دادگاه مراجعه شود.\n' +
            '2.گرفتن هرگونه خسارت از سمت طرفین بعد از احراز از طرف مراجع قضایی قابل وصول خواهد بود.\n'
    },
]
